import 'package:flutter/material.dart';
import 'data/models/meal.dart';

List<Meal> DUMMY_MEALS = [
  Meal(title: 'Гавайи',
       subType: 'Салаты',
      typeMeal: 'Европейская',
      ingriedent: [
        'Куриная грудка',
        'черри',
        'свежая зелень',
        "маринованные вешенки",
        "кукуруза",
        "чеснок"
      ],
      description: "Что бы мне не говорили, а самый вкусный шашлык получается из баранины. Есть правда один минус. На базаре невозможно купить нормальную баранину, все скупают на корню шашлычники.Не беда, если руки растут из нужного места, шашлык можно приготовить из того что оставили нам эти коршуны. Будем готовить бараньи ребрышки. Не те кусочки, где больше всего мяса, а те кусочки, которые остались после налета саранчи",
      cost:32000,
      imageUrl: 'assets/images/food1.png'),
  Meal(title: 'Гавайи',
      subType: 'Салаты',
      typeMeal: 'Европейская',
      ingriedent: [
        'Куриная грудка',
        'черри',
        'свежая зелень',
        "маринованные вешенки",
        "кукуруза",
        "чеснок"
      ],
      description: "Что бы мне не говорили, а самый вкусный шашлык получается из баранины. Есть правда один минус. На базаре невозможно купить нормальную баранину, все скупают на корню шашлычники.Не беда, если руки растут из нужного места, шашлык можно приготовить из того что оставили нам эти коршуны. Будем готовить бараньи ребрышки. Не те кусочки, где больше всего мяса, а те кусочки, которые остались после налета саранчи",

      cost:32000,
      imageUrl: 'assets/images/food1.png'),
  Meal(title: 'Гавайи',
      subType: 'Салаты',
      typeMeal: 'Европейская',
      ingriedent: [
        'Куриная грудка',
        'черри',
        'свежая зелень',
        "маринованные вешенки",
        "кукуруза",
        "чеснок"
      ],
      description: "Что бы мне не говорили, а самый вкусный шашлык получается из баранины. Есть правда один минус. На базаре невозможно купить нормальную баранину, все скупают на корню шашлычники.Не беда, если руки растут из нужного места, шашлык можно приготовить из того что оставили нам эти коршуны. Будем готовить бараньи ребрышки. Не те кусочки, где больше всего мяса, а те кусочки, которые остались после налета саранчи",
      cost:32000,
      imageUrl: 'assets/images/food1.png'),
  Meal(title: 'Гавайи',
      subType: 'Салаты',
      typeMeal: 'Европейская',
      ingriedent: [
        'Куриная грудка',
        'черри',
        'свежая зелень',
        "маринованные вешенки",
        "кукуруза",
        "чеснок"
      ],
      description: "Что бы мне не говорили, а самый вкусный шашлык получается из баранины. Есть правда один минус. На базаре невозможно купить нормальную баранину, все скупают на корню шашлычники.Не беда, если руки растут из нужного места, шашлык можно приготовить из того что оставили нам эти коршуны. Будем готовить бараньи ребрышки. Не те кусочки, где больше всего мяса, а те кусочки, которые остались после налета саранчи",

      cost:32000,
      imageUrl: 'assets/images/food1.png'),
  Meal(title: 'Гавайи',
      subType: 'Салаты',
      typeMeal: 'Европейская',
      ingriedent: [
        'Куриная грудка',
        'черри',
        'свежая зелень',
        "маринованные вешенки",
        "кукуруза",
        "чеснок"
      ],
      description: "Что бы мне не говорили, а самый вкусный шашлык получается из баранины. Есть правда один минус. На базаре невозможно купить нормальную баранину, все скупают на корню шашлычники.Не беда, если руки растут из нужного места, шашлык можно приготовить из того что оставили нам эти коршуны. Будем готовить бараньи ребрышки. Не те кусочки, где больше всего мяса, а те кусочки, которые остались после налета саранчи",
      cost:32000,
      imageUrl: 'assets/images/food1.png'),
  Meal(title: 'Гавайи',
      subType: 'Салаты',
      typeMeal: 'Европейская',
      ingriedent: [
        'Куриная грудка',
        'черри',
        'свежая зелень',
        "маринованные вешенки",
        "кукуруза",
        "чеснок"
      ],
      description: "Что бы мне не говорили, а самый вкусный шашлык получается из баранины. Есть правда один минус. На базаре невозможно купить нормальную баранину, все скупают на корню шашлычники.Не беда, если руки растут из нужного места, шашлык можно приготовить из того что оставили нам эти коршуны. Будем готовить бараньи ребрышки. Не те кусочки, где больше всего мяса, а те кусочки, которые остались после налета саранчи",
      cost:32000,
      imageUrl: 'assets/images/food1.png'),
  Meal(title: 'Гавайи',
      subType: 'Салаты',
      typeMeal: 'Европейская',
      ingriedent: [
        'Куриная грудка',
        'черри',
        'свежая зелень',
        "маринованные вешенки",
        "кукуруза",
        "чеснок"
      ],
      description: "Что бы мне не говорили, а самый вкусный шашлык получается из баранины. Есть правда один минус. На базаре невозможно купить нормальную баранину, все скупают на корню шашлычники.Не беда, если руки растут из нужного места, шашлык можно приготовить из того что оставили нам эти коршуны. Будем готовить бараньи ребрышки. Не те кусочки, где больше всего мяса, а те кусочки, которые остались после налета саранчи",

      cost:32000,
      imageUrl: 'assets/images/food1.png'),
  Meal(title: 'Гавайи',
      subType: 'Салаты',
      typeMeal: 'Европейская',
      ingriedent: [
        'Куриная грудка',
        'черри',
        'свежая зелень',
        "маринованные вешенки",
        "кукуруза",
        "чеснок"
      ],
      description: "Что бы мне не говорили, а самый вкусный шашлык получается из баранины. Есть правда один минус. На базаре невозможно купить нормальную баранину, все скупают на корню шашлычники.Не беда, если руки растут из нужного места, шашлык можно приготовить из того что оставили нам эти коршуны. Будем готовить бараньи ребрышки. Не те кусочки, где больше всего мяса, а те кусочки, которые остались после налета саранчи",
      cost:32000,
      imageUrl: 'assets/images/food1.png'),
  Meal(title: 'Гавайи',
      subType: 'Салаты',
      typeMeal: 'Европейская',
      ingriedent: [
        'Куриная грудка',
        'черри',
        'свежая зелень',
        "маринованные вешенки",
        "кукуруза",
        "чеснок"
      ],
      description: "Что бы мне не говорили, а самый вкусный шашлык получается из баранины. Есть правда один минус. На базаре невозможно купить нормальную баранину, все скупают на корню шашлычники.Не беда, если руки растут из нужного места, шашлык можно приготовить из того что оставили нам эти коршуны. Будем готовить бараньи ребрышки. Не те кусочки, где больше всего мяса, а те кусочки, которые остались после налета саранчи",
      cost:32000,
      imageUrl: 'assets/images/food1.png'),
];
List<Color> COLORS=[
  Colors.orange.shade300,
  Colors.deepPurple.shade200,
  Colors.blue.shade200,
  Colors.cyan.shade300,
  Colors.pink.shade200,
  Colors.teal.shade100,
  Colors.indigo.shade200,
];